-------------------------------------
-- Практические задание 1. Часть 2 --
-------------------------------------

module Pr01_2 where

myFST :: (a, b , c) -> a
myFST (a, _, _) = a

mySND :: (a, b, c) -> b
mySND (_, a, _) = a

myTHRD :: (a, b, c) -> c
myTHRD (_, _, a) = a

myZipSave :: [a] -> [b] -> ([(a, b)], [a], [b])
myZipSave [] ys = ([], [], ys)
myZipSave xs [] = ([], xs, [])
myZipSave (x:xs) (y:ys) = ((x, y) : myFST res, mySND res, myTHRD res) where
    res = myZipSave xs ys

myUnzipSave :: ([(a, b)], [a], [b]) -> ([a], [b])
myUnzipSave ([], restX, restY) = (restX, restY)
myUnzipSave ((x, y) : pairs, restX, restY) = (x : xs, y : ys) where
    (xs, ys) = myUnzipSave (pairs, restX, restY)

{-

Напишите реализацию функций:
-- myZipSave - попарное объединение двух списков в список пар и сохранение хвоста более длинного списка 
-- myUnzipSave - разделение списка пар на пару списков с восстановлением более длинного списка если исходные списки были разного размера
-- myReverse - разворот списка с использованием сверток
-- myFoldl1 - левая свертка для не пустых списков (без инициирующего значения)
-- myFoldr1 - правая свертка для не пустых списков (без инициирующего значения)
-- myTakeWhile - реализовать с использованием сверток
-- mySpan - реализовать с использованием сверток
-- myMaybe - обработка возможно отсутствующего значения или возвращение значение по умолчанию (maybe)
-- myMap - реализуйте функцию map с использованием типа MyList из материалов лекции
-- myUnFoldr - развертка (операция обратная к свертке)

-- Расширьте типы для выпекания тортов из материалов лекции:
    -- Добавить возможность испечь не менее трех типов тортов
    -- Контроль числа и объема используемых ингредиентов
    -- Обработку недостатка или отсутствия ингредиентов

-}
